### Terragrunt Plan :memo:

```text
16:12:34.587 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./aliyun

Group 2
- Module ./hosts


16:12:42.587 STDOUT [aliyun] tofu: Acquiring state lock. This may take a few moments...
16:13:12.339 STDOUT [aliyun] tofu: OpenTofu used the selected providers to generate the following execution
16:13:12.339 STDOUT [aliyun] tofu: plan. Resource actions are indicated with the following symbols:
16:13:12.339 STDOUT [aliyun] tofu:   ~ update in-place
16:13:12.339 STDOUT [aliyun] tofu: -/+ destroy and then create replacement
16:13:12.339 STDOUT [aliyun] tofu: OpenTofu will perform the following actions:
16:13:12.339 STDOUT [aliyun] tofu:   # alicloud_instance.hgh0 will be updated in-place
16:13:12.339 STDOUT [aliyun] tofu:   ~ resource "alicloud_instance" "hgh0" {
16:13:12.339 STDOUT [aliyun] tofu:         id                                 = "i-bp141zch5wpf792fhovg"
16:13:12.339 STDOUT [aliyun] tofu:       ~ security_groups                    = [
16:13:12.339 STDOUT [aliyun] tofu:           - "sg-bp1asx4zzxwgp97pmzxp",
16:13:12.339 STDOUT [aliyun] tofu:         ] -> (known after apply)
16:13:12.339 STDOUT [aliyun] tofu:         tags                               = {
16:13:12.340 STDOUT [aliyun] tofu:             "Terraform" = "true"
16:13:12.340 STDOUT [aliyun] tofu:         }
16:13:12.340 STDOUT [aliyun] tofu:         # (46 unchanged attributes hidden)
16:13:12.340 STDOUT [aliyun] tofu:     }
16:13:12.340 STDOUT [aliyun] tofu:   # alicloud_instance.hgh1 will be updated in-place
16:13:12.340 STDOUT [aliyun] tofu:   ~ resource "alicloud_instance" "hgh1" {
16:13:12.340 STDOUT [aliyun] tofu:         id                                 = "i-bp1gkwv2qckx68s614x6"
16:13:12.340 STDOUT [aliyun] tofu:       ~ security_groups                    = [
16:13:12.340 STDOUT [aliyun] tofu:           - "sg-bp1asx4zzxwgp97pmzxp",
16:13:12.340 STDOUT [aliyun] tofu:         ] -> (known after apply)
16:13:12.340 STDOUT [aliyun] tofu:         tags                               = {
16:13:12.340 STDOUT [aliyun] tofu:             "Terraform" = "true"
16:13:12.340 STDOUT [aliyun] tofu:         }
16:13:12.340 STDOUT [aliyun] tofu:         # (48 unchanged attributes hidden)
16:13:12.340 STDOUT [aliyun] tofu:     }
16:13:12.340 STDOUT [aliyun] tofu:   # alicloud_instance.hgh2 will be updated in-place
16:13:12.340 STDOUT [aliyun] tofu:   ~ resource "alicloud_instance" "hgh2" {
16:13:12.340 STDOUT [aliyun] tofu:         id                                 = "i-bp1fgtgt67nbd53ysp43"
16:13:12.340 STDOUT [aliyun] tofu:       ~ security_groups                    = [
16:13:12.340 STDOUT [aliyun] tofu:           - "sg-bp1asx4zzxwgp97pmzxp",
16:13:12.340 STDOUT [aliyun] tofu:         ] -> (known after apply)
16:13:12.340 STDOUT [aliyun] tofu:         tags                               = {
16:13:12.340 STDOUT [aliyun] tofu:             "Terraform" = "true"
16:13:12.341 STDOUT [aliyun] tofu:         }
16:13:12.341 STDOUT [aliyun] tofu:         # (49 unchanged attributes hidden)
16:13:12.341 STDOUT [aliyun] tofu:     }
16:13:12.341 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group.this must be replaced
16:13:12.341 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group" "this" {
16:13:12.341 STDOUT [aliyun] tofu:       + description         = "Hangzhou Security Group"
16:13:12.341 STDOUT [aliyun] tofu:       ~ id                  = "sg-bp1asx4zzxwgp97pmzxp" -> (known after apply)
16:13:12.341 STDOUT [aliyun] tofu:       ~ inner_access        = false -> (known after apply)
16:13:12.341 STDOUT [aliyun] tofu:       + inner_access_policy = (known after apply)
16:13:12.341 STDOUT [aliyun] tofu:       + name                = "hgh-sg"
16:13:12.341 STDOUT [aliyun] tofu:       - tags                = {} -> null
16:13:12.341 STDOUT [aliyun] tofu:       + vpc_id              = "vpc-bp1uxe2x9piyejy6r5x4s" # forces replacement
16:13:12.341 STDOUT [aliyun] tofu:         # (1 unchanged attribute hidden)
16:13:12.341 STDOUT [aliyun] tofu:     }
16:13:12.341 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["icmp:0.0.0.0/0:-1"] must be replaced
16:13:12.341 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.341 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:icmp:-1/-1:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.341 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.342 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.342 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.342 STDOUT [aliyun] tofu:     }
16:13:12.342 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:22"] must be replaced
16:13:12.342 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.342 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:22/22:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.342 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.342 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.342 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.342 STDOUT [aliyun] tofu:     }
16:13:12.342 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:25565"] must be replaced
16:13:12.342 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.342 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:25565/25565:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.342 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.342 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.343 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.343 STDOUT [aliyun] tofu:     }
16:13:12.343 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:443"] must be replaced
16:13:12.343 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.343 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:443/443:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.343 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.343 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.343 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.343 STDOUT [aliyun] tofu:     }
16:13:12.343 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:0.0.0.0/0:80"] must be replaced
16:13:12.343 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.343 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:80/80:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.343 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.343 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.343 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.343 STDOUT [aliyun] tofu:     }
16:13:12.343 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:::/0:22"] must be replaced
16:13:12.344 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.344 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:22/22:intranet:__/0:accept:1" -> (known after apply)
16:13:12.344 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.344 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.344 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.344 STDOUT [aliyun] tofu:     }
16:13:12.344 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:::/0:25565"] must be replaced
16:13:12.344 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.344 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:25565/25565:intranet:__/0:accept:1" -> (known after apply)
16:13:12.344 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.344 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.344 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.344 STDOUT [aliyun] tofu:     }
16:13:12.344 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:::/0:443"] must be replaced
16:13:12.344 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.344 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:443/443:intranet:__/0:accept:1" -> (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.345 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.345 STDOUT [aliyun] tofu:     }
16:13:12.345 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["tcp:::/0:80"] must be replaced
16:13:12.345 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.345 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:tcp:80/80:intranet:__/0:accept:1" -> (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.345 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.345 STDOUT [aliyun] tofu:     }
16:13:12.345 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["udp:0.0.0.0/0:3478"] must be replaced
16:13:12.345 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.345 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:udp:3478/3478:intranet:0.0.0.0/0:accept:1" -> (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.345 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.346 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.346 STDOUT [aliyun] tofu:     }
16:13:12.346 STDOUT [aliyun] tofu:   # module.sg.alicloud_security_group_rule.this["udp:::/0:3478"] must be replaced
16:13:12.346 STDOUT [aliyun] tofu: -/+ resource "alicloud_security_group_rule" "this" {
16:13:12.346 STDOUT [aliyun] tofu:       ~ id                = "sg-bp1asx4zzxwgp97pmzxp:ingress:udp:3478/3478:intranet:__/0:accept:1" -> (known after apply)
16:13:12.346 STDOUT [aliyun] tofu:       + prefix_list_id    = (known after apply)
16:13:12.346 STDOUT [aliyun] tofu:       ~ security_group_id = "sg-bp1asx4zzxwgp97pmzxp" # forces replacement -> (known after apply) # forces replacement
16:13:12.346 STDOUT [aliyun] tofu:         # (7 unchanged attributes hidden)
16:13:12.346 STDOUT [aliyun] tofu:     }
16:13:12.346 STDOUT [aliyun] tofu: Plan: 12 to add, 3 to change, 12 to destroy.
16:13:12.346 STDOUT [aliyun] tofu: 
16:13:12.740 STDOUT [aliyun] tofu: Releasing state lock. This may take a few moments...
16:13:19.135 STDOUT [hosts] tofu: Acquiring state lock. This may take a few moments...
16:13:20.806 STDOUT [hosts] tofu: module.nixos["hgh2"].data.external.build: Reading...
16:13:20.806 STDOUT [hosts] tofu: module.nixos["hgh0"].data.external.build: Reading...
16:13:20.807 STDOUT [hosts] tofu: module.nixos["sin0"].data.external.build: Reading...
16:13:20.810 STDOUT [hosts] tofu: module.nixos["sha0"].data.external.build: Reading...
16:13:20.831 STDOUT [hosts] tofu: module.nixos["hgh2"].data.external.keyscan: Reading...
16:13:20.831 STDOUT [hosts] tofu: module.nixos["sha0"].data.external.keyscan: Reading...
16:13:20.831 STDOUT [hosts] tofu: module.nixos["sin0"].data.external.keyscan: Reading...
16:13:20.831 STDOUT [hosts] tofu: module.nixos["hgh0"].data.external.keyscan: Reading...
16:13:23.318 STDOUT [hosts] tofu: module.nixos["hgh0"].data.external.keyscan: Read complete after 2s [id=-]
16:13:23.325 STDOUT [hosts] tofu: module.nixos["sin0"].data.external.keyscan: Read complete after 2s [id=-]
16:13:23.681 STDOUT [hosts] tofu: module.nixos["sha0"].data.external.keyscan: Read complete after 3s [id=-]
16:13:23.855 STDOUT [hosts] tofu: module.nixos["hgh2"].data.external.keyscan: Read complete after 3s [id=-]
16:13:30.807 STDOUT [hosts] tofu: module.nixos["hgh2"].data.external.build: Still reading... [10s elapsed]
16:13:30.807 STDOUT [hosts] tofu: module.nixos["hgh0"].data.external.build: Still reading... [10s elapsed]
16:13:30.808 STDOUT [hosts] tofu: module.nixos["sin0"].data.external.build: Still reading... [10s elapsed]
16:13:30.811 STDOUT [hosts] tofu: module.nixos["sha0"].data.external.build: Still reading... [10s elapsed]
16:13:35.984 STDOUT [hosts] tofu: module.nixos["sha0"].data.external.build: Read complete after 15s [id=-]
16:13:35.993 STDOUT [hosts] tofu: module.nixos["sin0"].data.external.build: Read complete after 15s [id=-]
16:13:36.086 STDOUT [hosts] tofu: module.nixos["hgh0"].data.external.build: Read complete after 15s [id=-]
16:13:36.106 STDOUT [hosts] tofu: module.nixos["hgh2"].data.external.build: Read complete after 15s [id=-]
16:13:36.124 STDOUT [hosts] tofu: data.external.headscale["cn"]: Reading...
16:13:39.290 STDOUT [hosts] tofu: data.external.headscale["cn"]: Read complete after 3s [id=-]
16:13:39.313 STDOUT [hosts] tofu: OpenTofu used the selected providers to generate the following execution
16:13:39.313 STDOUT [hosts] tofu: plan. Resource actions are indicated with the following symbols:
16:13:39.313 STDOUT [hosts] tofu: -/+ destroy and then create replacement
16:13:39.313 STDOUT [hosts] tofu: OpenTofu will perform the following actions:
16:13:39.313 STDOUT [hosts] tofu:   # module.nixos["hgh0"].null_resource.deploy[0] must be replaced
16:13:39.313 STDOUT [hosts] tofu: -/+ resource "null_resource" "deploy" {
16:13:39.313 STDOUT [hosts] tofu:       ~ id       = "8210777112773607468" -> (known after apply)
16:13:39.313 STDOUT [hosts] tofu:       ~ triggers = { # forces replacement
16:13:39.314 STDOUT [hosts] tofu:           ~ "build"       = "/nix/store/aid4dvpahr4r7pss00gklzkcpmyvxz07-nixos-system-hgh0-25.05.20241125.4633a7c" -> "/nix/store/s881kaapa0cvwci4s532nc54j38y4l79-nixos-system-hgh0-25.05.20241207.22c3f2c"
16:13:39.314 STDOUT [hosts] tofu:             # (1 unchanged element hidden)
16:13:39.314 STDOUT [hosts] tofu:         }
16:13:39.314 STDOUT [hosts] tofu:     }
16:13:39.314 STDOUT [hosts] tofu:   # module.nixos["hgh2"].null_resource.deploy[0] must be replaced
16:13:39.314 STDOUT [hosts] tofu: -/+ resource "null_resource" "deploy" {
16:13:39.314 STDOUT [hosts] tofu:       ~ id       = "4030997520054190876" -> (known after apply)
16:13:39.314 STDOUT [hosts] tofu:       ~ triggers = { # forces replacement
16:13:39.314 STDOUT [hosts] tofu:           ~ "build"       = "/nix/store/znk2p8z28p1p06xjjbjya9d6zvfibcxa-nixos-system-hgh2-25.05.20241125.4633a7c" -> "/nix/store/d6710g6dz3x2ijl4lr56mhaqqns4af1i-nixos-system-hgh2-25.05.20241207.22c3f2c"
16:13:39.314 STDOUT [hosts] tofu:             # (1 unchanged element hidden)
16:13:39.314 STDOUT [hosts] tofu:         }
16:13:39.314 STDOUT [hosts] tofu:     }
16:13:39.314 STDOUT [hosts] tofu:   # module.nixos["sha0"].null_resource.deploy[0] must be replaced
16:13:39.314 STDOUT [hosts] tofu: -/+ resource "null_resource" "deploy" {
16:13:39.314 STDOUT [hosts] tofu:       ~ id       = "3478342906027174868" -> (known after apply)
16:13:39.314 STDOUT [hosts] tofu:       ~ triggers = { # forces replacement
16:13:39.314 STDOUT [hosts] tofu:           ~ "build"       = "/nix/store/36rxp188215vigy6rchx2y98ncj9pn2n-nixos-system-sha0-25.05.20241125.4633a7c" -> "/nix/store/h9i59ak0fmw2jrr2fy23sqi2wjy491l1-nixos-system-sha0-25.05.20241207.22c3f2c"
16:13:39.315 STDOUT [hosts] tofu:             # (1 unchanged element hidden)
16:13:39.315 STDOUT [hosts] tofu:         }
16:13:39.315 STDOUT [hosts] tofu:     }
16:13:39.315 STDOUT [hosts] tofu:   # module.nixos["sin0"].null_resource.deploy[0] must be replaced
16:13:39.315 STDOUT [hosts] tofu: -/+ resource "null_resource" "deploy" {
16:13:39.315 STDOUT [hosts] tofu:       ~ id       = "6080329375037183930" -> (known after apply)
16:13:39.315 STDOUT [hosts] tofu:       ~ triggers = { # forces replacement
16:13:39.315 STDOUT [hosts] tofu:           ~ "build"       = "/nix/store/s0qkw8c0k94sgmjvv1y1yd2bf03p5qxq-nixos-system-sin0-25.05.20241125.4633a7c" -> "/nix/store/kvx77p5kmgmcrnwfffhk8wqf5pj95l96-nixos-system-sin0-25.05.20241207.22c3f2c"
16:13:39.315 STDOUT [hosts] tofu:             # (1 unchanged element hidden)
16:13:39.315 STDOUT [hosts] tofu:         }
16:13:39.315 STDOUT [hosts] tofu:     }
16:13:39.315 STDOUT [hosts] tofu: Plan: 4 to add, 0 to change, 4 to destroy.
16:13:39.315 STDOUT [hosts] tofu: 
16:13:39.713 STDOUT [hosts] tofu: Releasing state lock. This may take a few moments...
```

**Status**: out of sync :warning: